app/Controllers/GuruController.php

    public function new()
    {
        $jadwal = new Jadwal();
        $data = [
            'jadwal' => $jadwal->findAll(),
            'guru' => $this->guru->findAll(),
            'validation' => \Config\Services::validation()
        ];
---
SELECT *
FROM `jadwal`
SELECT *
FROM `guru`