app/Controllers/JadwalController.php

    public function index()
    {
        $data['jadwal'] = $this->jadwal->findAll();
---
SELECT *
FROM `jadwal`

    public function save()
    {
        $data = [
            'hari' => $this->request->getVar('hari'),
            'jenis_kegiatan' => $this->request->getVar('jenis_kegiatan'),

        ];

        if(!$this->validate([
            'hari' => [
                'rules' => 'required',
                'errors' => [
                    'required' => 'Hari harus dipilih'
                ]
            ],
            'jenis_kegiatan' => [
                'rules' => 'required',
                'errors' => [
                    'required' => 'Kegiatan Harus Dipilih'
                ]
            ],
        ]))

        if (!$this->jadwal->validate($data)) {
            return redirect()->to('jadwal/new')->withInput()->with('errors', $this->jadwal->errors());
        }
        try {
            $this->jadwal->protect(false)->insert($data);
---
INSERT INTO `jadwal` (`hari`, `jenis_kegiatan`) VALUES ('Jumat', 'Akademik')