app/Controllers/PageController.php

    public function dashboard()
    {
        $guru = new Guru();
        $siswa = new Siswa();
        $kegiatan = new Kegiatan();
        $data['jumlah_guru'] = $guru->countAll();
        $data['jumlah_siswa'] = $siswa->countAll();
        $data['jumlah_kegiatan'] = $kegiatan->countAll();
---
SELECT COUNT(*) AS `numrows` FROM `guru`
SELECT COUNT(*) AS `numrows` FROM `siswa`
SELECT COUNT(*) AS `numrows` FROM `kegiatan`