app/Controllers/SiswaController.php

    public function delete($id_siswa){
        try {
            $this->siswa->delete($id_siswa);
---
DELETE FROM `siswa`
WHERE `id_siswa` IN ('7')