app/Models/Absensi.php

SELECT `absensi`.`id_siswa`, COUNT(absensi.kehadiran) as jumlah_kehadiran, `siswa`.`nama_siswa` AS `nama_siswa`
FROM `absensi`
LEFT JOIN `siswa` ON `siswa`.`id_siswa` = `absensi`.`id_siswa`
GROUP BY `absensi`.`id_siswa`
ORDER BY `absensi`.`id_siswa` DESC
---
    public function get_data()
    {

        $builder = $this->db->table($this->table)
        ->join('siswa', 'siswa.id_siswa = ' . $this->table . '.id_siswa', 'left')
        ->select($this->table . '.id_siswa, COUNT(' . $this->table . '.kehadiran) as jumlah_kehadiran, siswa.nama_siswa AS nama_siswa')
        ->groupBy($this->table . '.id_siswa')
        ->orderBy($this->table . '.id_siswa', 'DESC')
        ->get();

SELECT `absensi`.*, `siswa`.`nama_siswa` AS `nama_siswa`
FROM `absensi`
LEFT JOIN `siswa` ON `siswa`.`id_siswa` = `absensi`.`id_siswa`
WHERE `absensi`.`id_siswa` = '2'
ORDER BY `absensi`.`tanggal` ASC
---
    public function detail($id_siswa)
    {
        return $this->db->table($this->table)
        ->join('siswa', 'siswa.id_siswa = ' . $this->table . '.id_siswa', 'left')
        ->select($this->table . '.*, siswa.nama_siswa AS nama_siswa')
        ->where($this->table . '.id_siswa', $id_siswa)
        ->orderBy($this->table . '.tanggal', 'ASC')
        ->get()
        ->getResultArray();