app/Models/Guru.php

    public function get_data()
    {
        return $this->db->table($this->table)
            ->join('jadwal', 'jadwal.id_jadwal = '.$this->table.'.id_jadwal', 'left')
            ->select('guru.*, jadwal.hari AS hari')
            ->orderBy($this->table.'.id_guru', 'DESC')->get()->getResultObject();
---
SELECT `guru`.*, `jadwal`.`hari` AS `hari`
FROM `guru`
LEFT JOIN `jadwal` ON `jadwal`.`id_jadwal` = `guru`.`id_jadwal`
ORDER BY `guru`.`id_guru` DESC