app/Models/Kegiatan.php

    public function get_data()
    {
        return $this->db->table($this->table)
            ->join('guru', 'guru.id_guru = '.$this->table.'.id_guru', 'left')
            ->join('jadwal', 'jadwal.id_jadwal = kegiatan.id_jadwal', 'left')
            ->select('kegiatan.*, guru.nama_guru AS nama_guru')
            ->select('kegiatan.*, jadwal.hari AS hari')
            ->orderBy($this->table.'.id_kegiatan', 'DESC')->get()->getResultArray();
---
SELECT `kegiatan`.*, `guru`.`nama_guru` AS `nama_guru`, `kegiatan`.*, `jadwal`.`hari` AS `hari`
FROM `kegiatan`
LEFT JOIN `guru` ON `guru`.`id_guru` = `kegiatan`.`id_guru`
LEFT JOIN `jadwal` ON `jadwal`.`id_jadwal` = `kegiatan`.`id_jadwal`
ORDER BY `kegiatan`.`id_kegiatan` DESC

    public function detail($id_kegiatan)
    {
        return $this->db->table($this->table)
            ->join('guru', 'guru.id_guru = '.$this->table.'.id_guru', 'left')
            ->join('jadwal', 'jadwal.id_jadwal = guru.id_jadwal', 'left')
            ->select('kegiatan.*, guru.nama_guru AS nama_guru')
            ->select('kegiatan.*, jadwal.hari AS hari')
            ->orderBy($this->table.'.id_kegiatan', $id_kegiatan)->get()->getResultArray();
---
SELECT `kegiatan`.*, `guru`.`nama_guru` AS `nama_guru`, `kegiatan`.*, `jadwal`.`hari` AS `hari`
FROM `kegiatan`
LEFT JOIN `guru` ON `guru`.`id_guru` = `kegiatan`.`id_guru`
LEFT JOIN `jadwal` ON `jadwal`.`id_jadwal` = `guru`.`id_jadwal`
ORDER BY `kegiatan`.`id_kegiatan`