app/Models/Laporan.php

    public function get_data()
    {
        return $this->db->table($this->table)
            ->join('siswa', 'siswa.id_siswa = '.$this->table.'.id_kegiatan', 'left')
            ->join('kegiatan', 'kegiatan.id_kegiatan = laporan.id_kegiatan', 'left')
            ->join('jadwal', 'jadwal.id_jadwal = laporan.id_jadwal', 'left')
            ->select('laporan.*, siswa.nama_siswa AS nama_siswa')
            ->select('laporan.*, siswa.alamat_siswa AS alamat_siswa')
            ->select('laporan.*, kegiatan.nama_kegiatan AS nama_kegiatan')
            ->select('laporan.*, jadwal.hari AS hari')
            ->orderBy($this->table.'.id_laporan', 'DESC')->get()->getResultArray();
---
SELECT `laporan`.*, `siswa`.`nama_siswa` AS `nama_siswa`, `laporan`.*, `siswa`.`alamat_siswa` AS `alamat_siswa`, `laporan`.*, `kegiatan`.`nama_kegiatan` AS `nama_kegiatan`, `laporan`.*, `jadwal`.`hari` AS `hari`
FROM `laporan`
LEFT JOIN `siswa` ON `siswa`.`id_siswa` = `laporan`.`id_kegiatan`
LEFT JOIN `kegiatan` ON `kegiatan`.`id_kegiatan` = `laporan`.`id_kegiatan`
LEFT JOIN `jadwal` ON `jadwal`.`id_jadwal` = `laporan`.`id_jadwal`
ORDER BY `laporan`.`id_laporan` DESC