app/Models/Laporan.php

    public function getLaporan($dari, $sampai)
    {
        return $this->select('kegiatan.nama_kegiatan, kegiatan.tanggal, kegiatan.waktu, guru.nama_guru, jadwal.hari')
            ->from('guru,jadwal')
            ->where('kegiatan.id_guru = guru.id_guru')
            ->where('kegiatan.id_jadwal = jadwal.id_jadwal')
            ->where('kegiatan.tanggal >=', $dari)
            ->where('kegiatan.tanggal <=', $sampai)
            ->get()
            ->getResultArray();
---
SELECT `kegiatan`.`nama_kegiatan`, `kegiatan`.`tanggal`, `kegiatan`.`waktu`, `guru`.`nama_guru`, `jadwal`.`hari`
FROM `kegiatan`, `guru`, `jadwal`
WHERE `kegiatan`.`id_guru` = `guru`.`id_guru`
AND `kegiatan`.`id_jadwal` = `jadwal`.`id_jadwal`
AND `kegiatan`.`tanggal` >= '2023-05-15'
AND `kegiatan`.`tanggal` <= '2023-05-22'