app/Models/Siswa.php

    public function get_data()
    {
        return $this->db->table($this->table)
            ->join('wali_murid', 'wali_murid.id_wali = '.$this->table.'.id_wali', 'left')
            ->select('siswa.*, wali_murid.nama_wali AS nama_wali')
            ->orderBy($this->table.'.id_siswa', 'DESC')->get()->getResultArray();
---
SELECT `siswa`.*, `wali_murid`.`nama_wali` AS `nama_wali`
FROM `siswa`
LEFT JOIN `wali_murid` ON `wali_murid`.`id_wali` = `siswa`.`id_wali`
ORDER BY `siswa`.`id_siswa` DESC